[
    {
        "id": "herald-code-brisk-hackathon",
        "name": "Herald Code Brisk Hackathon",
        "location": "Kuri Village, Kalinchowk",
        "date": "From February 15 to 17, 2020",
        "headerImage": [
            "https://heraldcollege.edu.np/storage/post/HCK-Code-Brisk-post_1676978748.jpg",
            "/image/events/Code_Brisk/Code_Brisk_4.png",
            "https://heraldcollege.edu.np/storage/uploads/Herald%20Code%20Brisk_1676978644.jpg",
            "https://heraldcollege.edu.np/storage/uploads/Herald%20Code%20Brisk%20Winner_1676978715.jpg"
        ],
        "profileImage": "/image/events/Code_Brisk/Code_Brisk.png",
        "description": [
            {
                "paragraph": "Herald DevCorps UI Visual Community, a student-led community at Herald College Kathmandu, successfully organized the nonstop 24-hour 'Code Brisk Hackathon 2023', at Kuri Village Kalinchowk. Situated at an altitude of 3447m above sea level, Code Brisk marks the hackathon held at the highest altitude."
            },
            {
                "paragraph": "A total of 13 colleges participated in the hackathon, with three outstanding teams chosen to construct their prototypes at Kalinchowk. The primary theme of this competition was to boost the tourism and hospitality sector of Kalinchowk through innovative and practical prototypes created by the top three teams."
            },
            {
                "paragraph": " Our community's unwavering effort and dedication to this project is commendable and has resulted in an incredible outcome. It is a testament to the passion and talent within our community, and I am proud of every one of you, says Mr. Prakash Shrestha, the CEO of Herald College Kathmandu, expressing his gratitude towards the organizing team."
            },
            {
                "paragraph": "Ms. Sujata Thapa, Head of Herald Devcorps, also praised the organizing committee and the top three colleges, “The effort of everyone in our community is reflected in the incredible work accomplished, and I am honored to be a part of it. Additionally, the top 3 teams presented truly impressive and achievable ideas, leaving us amazed."
            },
            {
                "paragraph": "Herald College Kathmandu congratulates the winning team, Virinchi College - Team Everest for their revolutionary project, 'Tidy Town', which employs sensors to tackle waste management issues and offers a practical way of waste disposal. We would also like to extend our appreciation to all the participating colleges."
            },
            {
                "image": "/image/events/Code_Brisk/Code_Brisk_1.png"
            },
            {
                "paragraph": "Furthermore, the ideas of the runner-up teams were: Amrit Science Campus (ASCOL): 'Prawas', a mobile app that facilitates transport and lodging options for the visitors of Kuri Village."
            },
            {
                "image": "/image/events/Code_Brisk/Code_Brisk_2.png"
            },
            {
                "paragraph": "The British College: 'Snowhub', an online platform that uses customer feedback to suggest optimal hotels and implements intelligent pricing strategies.."
            },
            {
                "image": "/image/events/Code_Brisk/Code_Brisk_3.png"
            },
            {
                "paragraph": "The Code Brisk Hackathon 2023 was a resounding success and demonstrated the exceptional creativity and technical skill of the students in Nepal."
            }
        ],
        "youtubeCode": "50aIeMJ5xyQ",
        "images": [
            "/image/events/Code_Brisk/Code_Brisk_3.png"
        ]
    },
    {
        "id": "visual-mela",
        "name": "Visual  Mela",
        "location": "Herald College, Naxal",
        "date": "From September 24 to November 17, 2021",
        "headerImage": [
            "/image/events/Visual_Mela/Visual_Mela_1.jpg",
            "/image/events/Visual_Mela/Visual_Mela_1.jpg"
        ],
        "profileImage":"/image/events/Visual_Mela/Visual_Mela_1.jpg",
        "description": [
            {
                "paragraph": "As a part of Herald Devfest 2021, UI Visuals hosted an exciting series of events called Visual Mela, which ran from September 24th to November 17th. Visual Mela included a range of events aimed at promoting creativity and providing opportunities for personal and professional growth."
            },    
            {
                "paragraph":"The events included a Figma Session, which focused on teaching participants about the popular design tool and how to utilize its features to create stunning designs. The Photography Session was aimed at budding photographers, providing tips and tricks for capturing amazing photos and learning how to enhance them using editing software. The series also included a Frontend Basics Workshop, which aimed at teaching participants the fundamental concepts of frontend development, including HTML, CSS, and JavaScript. This workshop was an excellent opportunity for anyone interested in pursuing a career in web development or wanting to enhance their skills."
            },
            {
                "title":"Figma Session",
                "date":"September 28 to 30, 2021 at 04:00 PM",
                "location":"Herald College, Naxal",
                "poster":"/image/events/Visual_Mela/Figma_Session_1.jpg"
            },
            {
                "paragraph": "UI Visuals organized a Figma Session led by our community leader Ms. Nerisha Shrestha as a part of their Visual Mela 2021 in DevFest 2021. This session was targeted towards beginners who are looking for guidance and a starting point for their design journey. Figma is a user-friendly web-based/desktop app that is useful for graphics designing and prototyping. It generates the code based on the design and can be used for wireframing websites, designing mobile app interfaces, prototyping, and creating social media posts. "
            },
            {
                "image": "/image/events/Visual_Mela/Figma_Session_2.png"
            },
            {
                "paragraph":"The session took place from today until the 30th of September, and participants were encouraged to bring their laptops to get hands-on experience with Figma tools and resources. UI Visuals was excited to share their knowledge and experience about interface designing with attendees. This Figma Session was a great opportunity for anyone looking to learn more about design, and it was a part of the series of events organized for the Visual Mela 2021."
            },
            {
                "title":"Photography Session",
                "date":"November 01, 2021 at 02:00 PM",
                "location":"Kumari Hall, Kamal Pokhari",
                "poster":"/image/events/Visual_Mela/Photography_Session_1.jpg"
            },
            {
                "paragraph": "UI Visuals organized a photography session as a part of the Visual Mela event in the Herald Devfest 2021. The session featured guest speakers Mr. Oscar Shrestha, a professional photographer and Islington graduate, and Mr. Pratik Pradhan and Mr. Rakshak Bhusan Bajracharya as guest lecturers. The session was held at Kumari Hall, Kamalpokhari. Participants had the opportunity to learn about photography concepts, creativity, dos and don'ts while clicking photos, and real-life experiences from the guest speakers. "
            },
            {
                "image": "/image/events/Visual_Mela/Photography_Session_2.png"
            },
            {
                "paragraph": "Additionally, the guest tutors provided professional ideas on how to click better photos and also provided feedback on the photographs submitted by the participants on that very day. Overall, the session was a great opportunity for photography enthusiasts to learn from industry professionals and improve their photography skills."
            },
            {   
                "title":"Frontend Basics Workshop",
                "date":"November 14, 2021 at 02:00 PM",
                "location":"Google Meet",
                "poster":"/image/events/Visual_Mela/Frontend_Basics_Workshop_1.png"
            },
            {
                "paragraph": "UI Visuals had organized an amazing Frontend Workshop as a part of Visual Mela 2021 where participants learned from the introduction to the basics of UI/UX to the development of a web app. The event aimed to acquire all the knowledge and skills of every changemaker and evolve the world to the next step."
            },
            {
                "image": "/image/events/Visual_Mela/Frontend_Basics_Workshop_2.png"
            },
            {
                "paragraph": "The guest curator of the workshop was Mrs. Momika Shrestha, a professional UI/UX engineer, design/development enthusiast, and associated as a Team Lead at Bits Beat IT Solution. She provided a workshop on web application frontend basics, sharing her professional as well as on-field knowledge and skills on being a web frontend developer with a live coding presentation. The workshop was successfully conducted, providing participants with valuable insights into the world of web development."
            },
            {   
                "title":"Photoshop Session for Beginners",
                "date":"April 12, 2022 at 03:00 PM",
                "location":"Herald College, Naxal",
                "poster":"/image/events/Visual_Mela/Photoshop_Session_1.jpg"
            },
            {
                "paragraph": "UI Visuals successfully organized a session on Photoshop Session for beginners. The event provided an opportunity for participants to learn how to use Photoshop tools to edit and manipulate images, as well as design minimalistic posters. The session was beneficial for students who are starting their journey in design and editing, as well as those who want to become familiar with other Adobe software in the future."
            },
            {
                "image": "/image/events/Visual_Mela/Photoshop_Session_2.png"
            },
            {
                "paragraph": "Participants were able to book their seats by filling out a form and joining the event. UI Visuals hopes that the knowledge and skills gained from this event will be useful for participants in their future design endeavors."
            }
        ],
        "youtubeCode": null,
        "images": []
    },
    {
        "id": "upc-design-hunt",
        "name": "UPC Design Hunt",
        "location": "Herald College, Naxal",
        "date": "February 09, 2023",
        "headerImage": [
            "/image/events/UPC_Design_Hunt/UPC_Design_Hunt_1.png",
            "https://lh3.googleusercontent.com/chat_attachment/AOFd8YYHlV91B1_YAXr-0AhsrzdIbFfQdnLI8u0aAsByCw-pgUW1X2fbPIxml_5ps-Az29YT3-QXl4Rm4tKw3ApkufiVgQvYNh_Xp6GxRgiE6YiyvHaRNSv5bkGODDvGNiorndPDS3oMKZbVPkrkTNTmzv6EgdRp10exeipw4MruayGn5gpAY2d3QQ7cF_X1ELxbEX5fI4xOLgu0jihU4FizvMWCogRVMj6Ngga4-j69IgCb41rLHDcah8bmD9-Z4zJ0AQYIbEHt18ZcKSle2ZJC4LM0guQXyMvIBIsVqyiBbhHwFkcQ5g7_tF0Ex05lWw=w512"
        ],
        "profileImage": "/image/events/UPC_Design_Hunt/UPC_Design_Hunt.png",
        "description": [
            {
                "paragraph": "UI Visuals recently organized an exciting event called Design Hunt, aimed at providing a platform for students to showcase their creativity and design skills. The event focused on designing a mobile app with unique features for new UPC early birds. The event was executed successfully, thanks to the efforts and support of our members.",
                "image": null
            },
            {
                "paragraph":"The event was structured to challenge participants' creativity and problem-solving abilities while encouraging collaboration and teamwork. Participants were provided with the necessary materials and resources to design their mobile app on paper, and they had to come up with unique and innovative features that would attract and engage new UPC early birds. The Design Hunt event was an excellent opportunity for students to showcase their skills and potential in the field of UI and Visual Design. It allowed them to explore their creativity and come up with new and innovative ideas while learning from their peers and community leaders.",
                "image":null
            },
            {
                "paragraph": null,
                "image": "/image/events/UPC_Design_Hunt/UPC_Design_Hunt_3.png"
            },
            {
                "paragraph": "Overall, the event was a huge success, and we are proud of our members for their dedication and hard work in organizing and executing the event. We look forward to organizing more such events in the future and providing students with opportunities to showcase their skills and creativity in the field of UI and Visual Design.",
                "image": null
            }
        ],
        "youtubeCode": null,
        "images": []
    },
    {
        "id": "vision-quest",
        "name": "Vision Quest",
        "location": "Herald College, Naxal",
        "date": "September 01, 2022 at 11:00 AM",
        "headerImage": [
            "/image/events/Vision_Quest/Vision_Quest_3.png",
            "/image/events/Vision_Quest/Vision_Quest_1.png"
        ],
        "profileImage": "/image/events/Vision_Quest/Vision_Quest.png",
        "description": [
            {
                "paragraph": "UI Visuals organized a remarkable event to help +2 students interested in the field of IT. The event named Vision Quest: Sneak Peek into the Design World was organized to give aspiring software developers and designers a first-hand experience of the design process. The event was specially designed for +2 students who were looking forward to pursuing a career in the field of IT.",
                "image": null
            },
            {
                "paragraph": "The event focused on two key topics, namely 'Software Development' and 'UI/UX Design'. Both of these topics are critical to the IT industry, and understanding them is essential for anyone looking to make a career in the field. The event was curated by the community leaders who had years of experience in these fields and had a lot to share with the participants.",
                "image": null
            },
            {
                "paragraph": null,
                "image": "/image/events/Vision_Quest/Vision_Quest_2.png"
            },
            {
                "paragraph": "The event was a great success, with many students attending and learning a lot about software development and UI/UX design. The participants were enthusiastic, and the experts' presentations were engaging and informative. Overall, the event was an excellent opportunity for +2 students to learn about the IT industry and gain valuable insights into software development and UI/UX design.",
                "image": null
            }
        ],
        "youtubeCode": null,
        "images": []
    },
    {
        "id":"photography-poster-design-contest",
        "name":"Photography and Poster Design Contest",
        "location": "Via Internet",
        "date": "June 11, 2021 at 03:00 PM",
        "profileImage": "/image/events/Photography_Poster_Design_Contest/Photography_Poster_Design_Contest.png",
        "headerImage":[
            "/image/events/Photography_Poster_Design_Contest/Photography_Poster_Design_Contest.png"
        ],
        "description":[
            {
                "paragraph":"UI Visuals organized an exciting Photography and Poster Design competition that was open to all individuals. The competition focused on indoor photography, editing, and designing a poster that could unleash the creativity of participants and make use of their lockdown days.",
                "image":null
            },
            {
                "paragraph":"The theme for the competition was 'Food,' and participants were required to design a poster for a restaurant using the same photograph clicked for photography. It was essential to ensure that the photo was related to the poster context to be eligible for the judgment.",
                "image":null
            },
            {
                "paragraph":null,
                "image": "/image/events/Photography_Poster_Design_Contest/Photography_Poster_Design_Contest_2.png"
            },
            {
                "paragraph":"To participate in the competition, each individual participant had to submit both the photograph and the poster. One winner for each category (Photography and Poster Design) was chosen based on the judgment done on the basis of both social media interaction and judges' decisions. The winners were awarded attractive cash prizes.",
                "image":null
            },
            {
                "paragraph":"The competition was a fantastic opportunity for photography and design enthusiasts to showcase their talents and creativity and gain valuable experience in the field. The event was well received and enjoyed by all participants",
                "image":null
            }
        ]
    },
    {
        "id":"community-meetup-3.0",
        "name":"Community Meetup 3.0",
        "date":"March 12, 2021 at 01:30 PM",
        "location":"Herald College, Naxal",
        "profileImage": "/image/events/Community_Meetup_3.0/Community_Meetup_3.0_1.png",
        "headerImage":[
            "/image/events/Community_Meetup_3.0/Community_Meetup_3.0_1.png"
        ],
        "description":[
            {
                "paragraph":"UI Visuals hosted its third community meetup, which was an exclusive opportunity for level 4 and 5 students of Herald College. The event provided attendees with the chance to learn about all the communities within Herald Dev Corps and understand them better.",
                "image":null
            },
            {
                "paragraph":"The meetup was designed to be a fun session where students could explore and discover their interests and passions. The event encouraged students to become members of the communities they were interested in, which would allow them to collaborate with like-minded individuals and be a part of the positive changes the communities are striving to make.",
                "image":null
            },
            {
                "paragraph":"UI Visuals is committed to creating a supportive and inclusive community that fosters growth and development among its members. The Community Meetup 3.0 was yet another successful event in achieving this goal, as it provided students with the opportunity to connect with each other and learn about the diverse range of communities available to them.",
                "image":null
            }
        ]
    },
    {
        "id":"webinar_1.0_on_poster_design",
        "name":"Webinar 1.0 on Poster Design",
        "date":"July 04, 2020 at 11:00 AM",
        "location":"Herald College, Naxal",
        "profileImage": "/image/events/Webinar_1.0_on_Poster_Design/Webinar_1.0_on_Poster_Design_1.png",
        "headerImage":[
            "/image/events/Webinar_1.0_on_Poster_Design/Webinar_1.0_on_Poster_Design_1.png"
        ],
        "description":[
            {
                "paragraph":"UI Visuals organized a webinar on Poster Designing, aimed at individuals who were interested in learning more about the field. The webinar was a 60-minute session led by Senior Designer Mr. Ayush Shakya from InfoDevelopers P. Ltd. Participants had the opportunity to learn about basic techniques in poster designing, guided by an experienced professional with years of industry experience.",
                "image":null
            },
            {
                "paragraph":"The event was an excellent opportunity for individuals who were looking to expand their knowledge and skill set in the area of poster design. Ayush Shakya shared his knowledge and expertise with participants, providing them with valuable insights into the field and techniques that they could apply in their own work.",
                "image":null
            },
            {
                "paragraph":"Overall, the webinar was a success, with participants leaving with a better understanding of poster design and the tools and techniques used in the industry. The event was just one example of UI Visuals' commitment to promoting creativity and providing valuable learning opportunities for their community members.",
                "image":null
            }
        ]
    },
    {
        "id":"meetup_2.0",
        "name":"Meetup 2.0 & Introduction to Designing & Web Portfolio",
        "date":"January 29, 2020 at 02:00 PM",
        "location":"Herald College, Naxal",
        "profileImage": "/image/events/Meetup_2.0/Meetup_2.0_1.png",
        "headerImage":[
            "/image/events/Meetup_2.0/Meetup_2.0_1.png"
        ],
        "description":[
            {
                "paragraph":"The second meetup organized by UI Visuals was focused on the topic of designing and web portfolios. The guest speaker Ayush Shakya and community member Sarjil Napit shared their insights on how to get started with designing, the best tools for designing, and sources of inspiration for design ideas. They also discussed the importance of prioritizing elements in design and the preparation process before starting a project.",
                "image":null
            },
            {
                "paragraph":null,
                "image": "/image/events/Meetup_2.0/Meetup_2.0_2.png"
            },
            {
                "paragraph":"Following this, the community co-leader Divya Jyoti Ranjit gave a briefing on the benefits of having a personal web portfolio website. He shared his experience of making his own website and provided tips on how to host the site effectively. The event aimed to equip participants with the knowledge and skills necessary for successful web design and development. Overall, it was a valuable event for anyone interested in this field.",
                "image":null
            }
        ]
    },
    {
        "id":"meetup_1.0",
        "name":"Meetup 1.0: Introduction to Community and Angular Development",
        "date":"September 1, 2019 at 12:30 PM",
        "location":"Herald College, Naxal",
        "profileImage": "/image/events/Meetup_1.0/Meetup_1.0_1.png",
        "headerImage":[
            "/image/events/Meetup_1.0/Meetup_1.0_1.png"
        ],
        "description":[
            {
                "paragraph":"UI Visuals organized their first event, a Meetup on Introduction to Community and Angular Development. The event was a great success with an informative and engaging presentation by the speaker, Mr. Sanjeev Tamang. The audience had the opportunity to learn about UI, Visuals, Angular and Enterprise Development, and to gain insights into real-time development practices.",
                "image":null
            },
            {
                "paragraph":null,
                "image": "/image/events/Meetup_1.0/Meetup_1.0_2.png"
            },
            {
                "paragraph":"Mr. Tamang shared his vast knowledge and experience on the subject, and the attendees were highly impressed with the valuable information and practical advice he provided. The event was a great platform for community members to come together and learn from each other.",
                "image":null
            }
        ]
    }
]